Функция СформироватьДанные(Начало, Конец) Экспорт
 Начало = НачалоДня(Начало); Конец = КонецДня(Конец);
 Запрос = Новый Запрос;
 Запрос.Текст = "ВЫБРАТЬ Продажи.Номенклатура КАК Номенклатура, Продажи.Продано КАК Продано,
 | СУММА(Продажи.КоличествоОборот) КАК Количество, СУММА(Продажи.СтоимостьОборот) КАК Себестоимость,
 | СУММА(Продажи.ВыручкаОборот) КАК Выручка,
 | СУММА(Продажи.ВыручкаОборот - Продажи.СтоимостьОборот) КАК Прибыль
 |ИЗ РегистрНакопления.ПродажиБухгалтерские.Обороты(&Начало, &Конец,) КАК Продажи
 |СГРУППИРОВАТЬ ПО Продажи.Номенклатура, Продажи.Продано";
 Запрос.УстановитьПараметр("Начало", Начало); Запрос.УстановитьПараметр("Конец", Конец);
 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
