Функция СформироватьДанные(Начало, Конец) Экспорт
    Если НачалоМесяца(Начало) <> НачалоМесяца(Конец) Тогда ВызватьИсключение "Отчет формируется за один календарный месяц"; КонецЕсли;
    Возврат Учет.ЗапросТаблица("ВЫБРАТЬ Сотрудник, Стаж, Процент, СУММА(Результат) КАК СуммаПремии
    |ИЗ РегистрРасчета.Начисления
    |ГДЕ Активность И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Премия)
    |И ПериодДействияНачало МЕЖДУ &Начало И &Конец
    |СГРУППИРОВАТЬ ПО Сотрудник, Стаж, Процент
    |УПОРЯДОЧИТЬ ПО Сотрудник.Наименование", Новый Структура("Начало,Конец", НачалоМесяца(Начало), КонецМесяца(Начало)));
КонецФункции
