Функция СформироватьДанные(Начало, Конец) Экспорт
 Начало = НачалоМесяца(Начало); Конец = КонецМесяца(Начало);
 Запрос = Новый Запрос;
 Запрос.Текст = "ВЫБРАТЬ Начисления.Сотрудник КАК Сотрудник, Начисления.Стаж КАК Стаж,
 | Начисления.Процент КАК Процент, СУММА(Начисления.Результат) КАК Сумма
 |ИЗ РегистрРасчета.Начисления КАК Начисления
 |ГДЕ Начисления.ПериодДействия МЕЖДУ &Начало И &Конец И Начисления.ВидРасчета = &Премия
 |СГРУППИРОВАТЬ ПО Начисления.Сотрудник, Начисления.Стаж, Начисления.Процент";
 Запрос.УстановитьПараметр("Начало", Начало); Запрос.УстановитьПараметр("Конец", Конец);
 Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ОсновныеНачисления.Премия);
 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
