Функция СформироватьДанные(Начало, Конец, Подразделение, ВидХарактеристики = Неопределено) Экспорт
    Если ВидХарактеристики = Неопределено Или Не ЗначениеЗаполнено(ВидХарактеристики) Тогда
        Виды = Учет.ЗапросТаблица("ВЫБРАТЬ ПЕРВЫЕ 1 Характеристика
        |ИЗ РегистрСведений.ЗначенияСвойств
        |УПОРЯДОЧИТЬ ПО ВЫБОР КОГДА Характеристика.Наименование = ""Производитель"" ТОГДА 0 ИНАЧЕ 1 КОНЕЦ, Характеристика.Наименование");
        ВидХарактеристики = ?(Виды.Количество() = 0, ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка(), Виды[0].Характеристика);
    КонецЕсли;
    Данные = Учет.ЗапросТаблица("ВЫБРАТЬ О.Номенклатура, О.Свойство,
    |ВЫБОР КОГДА З.Значение ЕСТЬ NULL ТОГДА О.Свойство.Наименование ИНАЧЕ ПРЕДСТАВЛЕНИЕ(З.Значение) КОНЕЦ КАК Характеристика,
    |СУММА(О.СтоимостьНачальныйОстаток) КАК НачальныйОстаток,
    |СУММА(О.СтоимостьПриход) КАК Приход, СУММА(О.СтоимостьРасход) КАК Расход,
    |СУММА(О.СтоимостьКонечныйОстаток) КАК КонечныйОстаток,
    |СУММА(О.КоличествоНачальныйОстаток) КАК НачальноеКоличество,
    |СУММА(О.КоличествоПриход) КАК КоличествоПриход,
    |СУММА(О.КоличествоРасход) КАК КоличествоРасход,
    |СУММА(О.КоличествоКонечныйОстаток) КАК КонечноеКоличество
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК О
    |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК З
    |ПО О.Свойство = З.Свойство И З.Характеристика = &ВидХарактеристики
    |СГРУППИРОВАТЬ ПО О.Номенклатура, О.Свойство, З.Значение, О.Свойство.Наименование
    |УПОРЯДОЧИТЬ ПО О.Номенклатура.Наименование", Новый Структура("Начало,Конец,Подразделение,ВидХарактеристики", НачалоДня(Начало), КонецДня(Конец), Подразделение, ВидХарактеристики));
    Данные.Сортировать("Характеристика,Номенклатура");
    Возврат Данные;
КонецФункции
