Процедура ОбработкаПроведения(Отказ, РежимПроведения)
 УчетСервер.НастроитьРасчеты(); УчетСервер.Блокировать("РегистрРасчета.Начисления");
 Движения.Начисления.Записывать=Истина;
 Для Каждого Стр Из ОсновныеНачисления Цикл
  Если Стр.ДатаОкончания<Стр.ДатаНачала Тогда Отказ=Истина; Сообщить("Некорректный период"); Возврат; КонецЕсли;
  Если Стр.ВидРасчета<>ПланыВидовРасчета.ОсновныеНачисления.Командировка И НачалоМесяца(Стр.ДатаНачала)<>НачалоМесяца(Стр.ДатаОкончания) Тогда Отказ=Истина; Сообщить("Тариф и премия вводятся в пределах месяца"); Возврат; КонецЕсли;
  Начало=Стр.ДатаНачала;
  Пока Начало<=Стр.ДатаОкончания Цикл
   Конец=Мин(КонецМесяца(Начало),КонецДня(Стр.ДатаОкончания));
   Д=Движения.Начисления.Добавить(); Д.ПериодРегистрации=НачалоМесяца(Дата);
   Д.ВидРасчета=Стр.ВидРасчета; Д.ПериодДействияНачало=НачалоДня(Начало); Д.ПериодДействияКонец=Конец;
   Д.Сотрудник=Стр.Сотрудник; Д.Подразделение=Стр.Подразделение;
   Д.БазовыйПериодНачало=ДобавитьМесяц(НачалоМесяца(Начало),?(Стр.ВидРасчета=ПланыВидовРасчета.ОсновныеНачисления.Командировка,-3,-1));
   Д.БазовыйПериодКонец=НачалоМесяца(Начало)-1;
   Начало=КонецМесяца(Начало)+1;
  КонецЦикла;
 КонецЦикла;
 Движения.Начисления.Записать();
 Дополнение=Движения.Начисления.ПолучитьДополнение();
 Для Каждого СтрДоп Из Дополнение Цикл
  Д=Движения.Начисления.Добавить();ЗаполнитьЗначенияСвойств(Д,СтрДоп,,"Регистратор,НомерСтроки");
  Д.Сторно=Истина;Д.ПериодРегистрации=СтрДоп.ПериодРегистрацииСторно;
  Д.ПериодДействияНачало=СтрДоп.ПериодДействияНачалоСторно;Д.ПериодДействияКонец=СтрДоп.ПериодДействияКонецСторно;
 КонецЦикла;
 Если Дополнение.Количество()>0 Тогда Движения.Начисления.Записать();КонецЕсли;
 Если ОсновныеНачисления.Количество()>0 Тогда
  МинДата=ОсновныеНачисления[0].ДатаНачала;МаксДата=ОсновныеНачисления[0].ДатаОкончания;
  Для Каждого Стр Из ОсновныеНачисления Цикл МинДата=Мин(МинДата,Стр.ДатаНачала);МаксДата=Макс(МаксДата,Стр.ДатаОкончания);КонецЦикла;
  УчетСервер.ПересчитатьСвязанные(Ссылка,НачалоМесяца(Дата),МинДата,КонецДня(МаксДата));
 КонецЕсли;
 УчетСервер.РассчитатьНабор(Движения.Начисления);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
 УчетСервер.Блокировать("РегистрРасчета.Начисления");Движения.Начисления.Записывать=Истина;Движения.Начисления.Очистить();Движения.Начисления.Записать();
 Если ОсновныеНачисления.Количество()>0 Тогда
  МинДата=ОсновныеНачисления[0].ДатаНачала;МаксДата=ОсновныеНачисления[0].ДатаОкончания;
  Для Каждого Стр Из ОсновныеНачисления Цикл МинДата=Мин(МинДата,Стр.ДатаНачала);МаксДата=Макс(МаксДата,Стр.ДатаОкончания);КонецЦикла;
  УчетСервер.ПересчитатьСвязанные(Ссылка,НачалоМесяца(Дата),МинДата,КонецДня(МаксДата));
 КонецЕсли;
КонецПроцедуры
