Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Попытка
        Учет.Начислить(ЭтотОбъект);
    Исключение
        Отказ = Истина;
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = ОписаниеОшибки();
        Сообщение.Сообщить();
        ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    Учет.Заблокировать("РегистрРасчета.Начисления");
    Движения.Начисления.Очистить();
    Движения.Начисления.Записать();
    Учет.ПересчитатьНачисления();
КонецПроцедуры
