Функция СформироватьДанные(Начало, Конец, Подразделение) Экспорт
 Начало = НачалоДня(Начало); Конец = КонецДня(Конец);
 Запрос = Новый Запрос;
 Запрос.Текст = "ВЫБРАТЬ
 | Остатки.Номенклатура КАК Номенклатура,
 | Значения.Характеристика КАК ВидХарактеристики, Значения.Значение КАК Характеристика,
 | Остатки.КоличествоНачальныйОстаток КАК НачальныйОстатокКоличество,
 | Остатки.КоличествоПриход КАК ПриходКоличество, Остатки.КоличествоРасход КАК РасходКоличество,
 | Остатки.КоличествоКонечныйОстаток КАК КонечныйОстатокКоличество,
 | Остатки.СтоимостьНачальныйОстаток КАК НачальныйОстаток,
 | Остатки.СтоимостьПриход КАК Приход, Остатки.СтоимостьРасход КАК Расход,
 | Остатки.СтоимостьКонечныйОстаток КАК КонечныйОстаток
 |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, Авто,, Подразделение = &Подразделение) КАК Остатки
 | ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК Значения ПО Остатки.Свойство = Значения.Свойство";
 Запрос.УстановитьПараметр("Начало", Начало); Запрос.УстановитьПараметр("Конец", Конец);
 Запрос.УстановитьПараметр("Подразделение", Подразделение);
 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
