Функция СформироватьДанные(Начало, Конец) Экспорт
    Виды = Новый Массив;
    Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЗаказаннаяНоменклатура);
    Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ПроданнаяНоменклатура);
    КорСчета = Новый Массив; КорСчета.Добавить(ПланыСчетов.Управленческий.Товары); КорСчета.Добавить(ПланыСчетов.Управленческий.Покупатели);
    Возврат Учет.ЗапросТаблица("ВЫБРАТЬ Данные.* ИЗ (ВЫБРАТЬ
    |ВЫРАЗИТЬ(Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
    |ВЫРАЗИТЬ(Субконто2 КАК Справочник.Номенклатура) КАК Продано,
    |СУММА(ВЫБОР КОГДА КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Товары) ТОГДА КоличествоОборотДт - КоличествоОборотКт ИНАЧЕ 0 КОНЕЦ) КАК Количество,
    |СУММА(ВЫБОР КОГДА КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Товары) ТОГДА СуммаОборотДт - СуммаОборотКт ИНАЧЕ 0 КОНЕЦ) КАК Себестоимость,
    |СУММА(ВЫБОР КОГДА КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Покупатели) ТОГДА СуммаОборотКт - СуммаОборотДт ИНАЧЕ 0 КОНЕЦ) КАК Продажа,
    |СУММА(СуммаОборотКт - СуммаОборотДт) КАК Прибыль
    |ИЗ РегистрБухгалтерии.Управленческий.Обороты(&Начало, &Конец, , Счет = &Счет, &Виды, , КорСчет В (&КорСчета))
    |СГРУППИРОВАТЬ ПО ВЫРАЗИТЬ(Субконто1 КАК Справочник.Номенклатура), ВЫРАЗИТЬ(Субконто2 КАК Справочник.Номенклатура)) КАК Данные
    |УПОРЯДОЧИТЬ ПО Данные.Номенклатура.Наименование, Данные.Продано.Наименование",
    Новый Структура("Начало,Конец,Счет,Виды,КорСчета", НачалоДня(Начало), КонецДня(Конец), ПланыСчетов.Управленческий.ПрибылиУбытки, Виды, КорСчета));
КонецФункции
