
&НаКлиенте
Процедура Заполнить(Команда)
	ВыполнитьОбработку();
	Сообщить("Обработка завершена!");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработку()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни, Подразделение, ЧасовВДень);
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ВыходныеДни = "67"; ЧасовВДень = 8;
КонецПроцедуры
