&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Начало = НачалоМесяца(ТекущаяДата()); Конец = КонецМесяца(Начало);
КонецПроцедуры
&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры
&НаСервере
Процедура СформироватьНаСервере()
    Данные = Отчеты.ВедомостьОУ.СформироватьДанные(Начало, Конец, Подразделение, ВидХарактеристики);
    Результат = Учет.ПечатныйОтчет(Данные, "ВедомостьОУ", Начало, Конец, ?(ЗначениеЗаполнено(ВидХарактеристики), Строка(ВидХарактеристики), "Производитель"));
    Результат.Область(2,1,2,6).Объединить(); Результат.Область(2,1).Текст = "Подразделение: " + Подразделение;
КонецПроцедуры
