&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)
 Начало=НачалоМесяца(ТекущаяДата());Конец=КонецМесяца(Начало);
КонецПроцедуры
&НаКлиенте
Процедура Сформировать(Команда)
 СформироватьНаСервере();
КонецПроцедуры
&НаСервере
Процедура СформироватьНаСервере()
 ОтчетОбъект=РеквизитФормыВЗначение("Объект");
 Данные=ОтчетОбъект.СформироватьДанные(Начало,Конец);
 Результат.Очистить();Результат.Область(1,1).Текст="ПродажиБух с "+Формат(Начало,"ДФ=dd.MM.yyyy")+" по "+Формат(Конец,"ДФ=dd.MM.yyyy");
 НомерКолонки=0;
 Для Каждого Колонка Из Данные.Колонки Цикл НомерКолонки=НомерКолонки+1;Результат.Область(3,НомерКолонки).Текст=Колонка.Имя;КонецЦикла;
 НомерСтроки=3;
 Для Каждого Стр Из Данные Цикл
  НомерСтроки=НомерСтроки+1;НомерКолонки=0;
  Для Каждого Колонка Из Данные.Колонки Цикл НомерКолонки=НомерКолонки+1;Результат.Область(НомерСтроки,НомерКолонки).Текст=Строка(Стр[Колонка.Имя]);КонецЦикла;
 КонецЦикла;
КонецПроцедуры
